## pandas에서 제공하는 대표적인 자료 구조

+ Series
+ DataFrame
+ https://pandas.pydata.org

In [1]:
import numpy as np
import pandas as pd

### 1. Series
+ 값과 인덱스를 하나로 합친 구조

In [5]:
s = pd.Series([9904312, 3448737, 2890451, 2466052])
print(s)
print(type(s))

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
for i in enumerate([9904312, 3448737, 2890451, 2466052]):
    print(i)

(0, 9904312)
(1, 3448737)
(2, 2890451)
(3, 2466052)

In [10]:
#### 인덱스를 자유롭게 지정
s = pd.Series([9904312, 3448737, 2890451, 2466052], index=["서울", "부산", "인천", "대구"])
print(s)

print("----------------------------")

print(s.values, type(s.values))
print(s.index)

print("----------------------------")

# 인덱스에 이름 지정
s.index.name = "도시"
print(s)

print("----------------------------")

# Series 전체에 이름 지정
s.name = "인구"
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
----------------------------
[9904312 3448737 2890451 2466052] <class 'numpy.ndarray'>
Index(['서울', '부산', '인천', '대구'], dtype='object')
----------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
----------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
##### 백터화 연산

s1 = s / 1000000
print(s1)

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [18]:
##### 인덱싱

print(s[1], s["부산"])

print("-----------------------------")

print(s[1:3])

print("-----------------------------")

print(s["부산":"인천"])

print("-----------------------------")

print(s.부산, ". ", s.서울)

print("-----------------------------")

print(s[(s > 250e4) & (s < 500e4)])

3448737 3448737
-----------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
-----------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
-----------------------------
3448737 .  9904312
-----------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [22]:
##### Series와 dict

print("서울" in s)
print("대전" in s)

print("--------------------------------")

print(list(s.items()))

print("--------------------------------")

{"서울" : 9904312, "부산" : 3448737, "인천" : 2890451, "대전" : 1490158}

s2 = pd.Series({"서울" : 9904312, "부산" : 3448737, "인천" : 2890451, "대전" : 1490158})

print(s2)

True
False
--------------------------------
[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('대구', 2466052)]
--------------------------------
서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64

In [26]:
##### 인덱스 기반 연산

print(s)
print("--------------------------------")
print(s2)
print("--------------------------------")

print(s-s2)

print("--------------------------------")

result = s - s2

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
--------------------------------
서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64
--------------------------------
대구    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64
--------------------------------

In [27]:
##### 결측치 제거

print(result)
print(result.notnull())
print(result[result.notnull()])

대구    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64
대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool
부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [34]:
##### 데이터 수정, 삭제, 추가

print(result)

print("------------------------------")
result["부산"] = 1.63   # 수정
print(result)
print("------------------------------")
result["경기"] = 2.45   # 추가
print(result)
print("------------------------------")
del result["서울"]      # 삭제
print(result)

대구     NaN
대전     NaN
부산    1.63
서울    0.00
인천    0.00
경기    2.45
dtype: float64
------------------------------
대구     NaN
대전     NaN
부산    1.63
서울    0.00
인천    0.00
경기    2.45
dtype: float64
------------------------------
대구     NaN
대전     NaN
부산    1.63
서울    0.00
인천    0.00
경기    2.45
dtype: float64
------------------------------

### 2. Dataframe
+ 여러 개의 Series를 묶어놓은 것

In [165]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [166]:
df = pd.DataFrame(data)
df

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

#### (1) 컬럼의 순서(위치) 바꾸기

In [167]:
cols = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
df = pd.DataFrame(data, columns = cols)
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972         0.0283
1  경상권  3448737  3393191  3512547  3655437         0.0163
2  수도권  2890451  2632035  2517680  2466338         0.0982
3  경상권  2466052  2431774  2456016  2473990         0.0141

### (2) 인덱스 변경

In [168]:
idx = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, columns = cols, index = idx)

df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [169]:
print(df.values)
print(df.columns)
print(df.index)

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]
Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')
Index(['서울', '부산', '인천', '대구'], dtype='object')

In [170]:
##### 컬럼과 인덱스에 이름 부여

df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [171]:
##### 전치

df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

### 인덱싱

In [172]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [173]:
##### 열 인덱싱

print(df["지역"])
print(type(df["지역"]))
      
print("-------------------------------")
      
print(df[["지역", "2005"]])
print(type(df[["지역", "2005"]]))
      
print("-------------------------------")

print(df[["지역"]])
      
print("-------------------------------")

# print(df[0])
# print(df[["2015" : "2005"]])

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object
<class 'pandas.core.series.Series'>
-------------------------------
특성   지역     2005
도시
서울  수도권  9762546
부산  경상권  3512547
인천  수도권  2517680
대구  경상권  2456016
<class 'pandas.core.frame.DataFrame'>
-------------------------------
특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권
-------------------------------

In [174]:
##### 행 인덱싱 ( 반드시 : 으로 슬라이싱 )

print(df[0 : 1])

print("-------------------------------")

print(df[0 : 2])

print("-------------------------------")

print(df[:])

print("-------------------------------")

print(df["서울" : "서울"])

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
-------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
-------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
-------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [175]:
##### 동시에 열과 행에 접근

print(df["2005"]["대구"])

# 2005년도부터 2015년도까지 서울, 부산, 인천의 인구수 조회

print(df[["2015", "2010", "2005"]]["서울":"인천"])

2456016
특성     2015     2010     2005
도시
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

### # (4) 추가, 수정, 삭제

In [176]:
# 수정
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
print(df)

# 추가
df["2010-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
print(df)

# 삭제
del df["2010-2010 증가율"]
print(df)

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41
특성   지역     2015     2010     2005     2000  2010-2015 증가율  2010-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

### (5) 실습

In [152]:
data = {
    "국어" : [80, 90, 70, 30], 
    "영어" : [90, 70, 60, 40], 
    "수학" : [90, 60, 80, 70]
}

# 1)  인덱스를 춘향, 몽룡, 향단, 방자로 구성된 데이터 프레임 df를 작성

df = pd.DataFrame(data)

idx = ["춘향", "몽룡", "향단", "방자"]
cols = ["국어", "영어", "수학"]
df = pd.DataFrame(data, columns = cols, index = idx)
print(df)

print("------------------------------------------")

# 2) 모든 학생의 수학 점수를 조회

print(df[["수학"]])

print("------------------------------------------")

# 3) 모든 학생의 국어와 영어 점수를 조회

print(df[["국어" , "영어"]])

print("------------------------------------------")

# 4) 모든 학생의 각 과목 평균점수를 새로운 열(과목 평균)로 추가

# 추가
df["평균점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
print(df)

print("------------------------------------------")

# 5) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 수정하시오.

df["영어"]["방자"] = 80
df["평균점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
print(df)

print("------------------------------------------")

# 6) 춘향의 점수를 데이터 프레임 형식으로 출력
print(df["춘향" : "춘향"])

print("------------------------------------------")

# 7) 향단의 점수를 Series로 출력
temp = df["향단" : "향단"]
temp_Series = pd.Series(temp.values.tolist()[0], index=temp.columns.values.tolist())
temp_Series.index.name = "향단"
print(temp_Series)

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70
------------------------------------------
    수학
춘향  90
몽룡  60
향단  80
방자  70
------------------------------------------
    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
------------------------------------------
    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67
------------------------------------------
    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00
------------------------------------------
    국어  영어  수학   평균점수
춘향  80  90  90  86.67
------------------------------------------
향단
국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
dtype: float64

C:\Users\dbs03\AppData\Local\Temp\ipykernel_17008\2191498340.py:40: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

### (6) 파일 입출력
+ read_csv()
+ to_csv()
+ read_table()

In [97]:
%%writefile data/sample1.csv

c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample1.csv

In [102]:
sample1 = pd.read_csv("data/sample1.csv")
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [113]:
%%writefile data/sample2.csv

1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample2.csv

In [114]:
sample1 = pd.read_csv("data/sample2.csv", names=["c1", "c2", "c3"])
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [122]:
##### 특정 열을 인덱스로 지정

sample2 = pd.read_csv("data/sample1.csv", index_col="c1")
sample2

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [131]:
%%writefile data/sample3.txt

c1    c2    c3    c4
0.23  0.33  0.354 0.2389
0.123 0.345 0.567 0.986

Overwriting data/sample3.txt

In [153]:
sample3 = pd.read_table("data/sample3.txt", sep="\s+")
sample3

      c1     c2     c3      c4
0  0.230  0.330  0.354  0.2389
1  0.123  0.345  0.567  0.9860

In [154]:
%%writefile data/sample4.txt
파일제목:sample4.txt
데이터설명 : 어쩌구 저쩌구
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample4.txt

In [156]:
# sample4 = pd.read_table("data/sample4.txt", sep=",", skiprows=[0, 1])
sample4 = pd.read_table("data/sample4.txt", sep=",", skiprows=2)
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [157]:
%%writefile data/sample5.csv
c1, c2, c3
1, 1.11, 
2, 없음, two
누락, 3.33, three

Overwriting data/sample5.csv

In [161]:
sample5 = pd.read_csv("data/sample5.csv", na_values=[" ", " 없음", "누락"])
sample5

    c1    c2      c3
0  1.0  1.11     NaN
1  2.0   NaN     two
2  NaN  3.33   three

In [181]:
##### 저장

df.to_csv("data/sample6.csv")
df.to_csv("data/sample7.txt", sep="|")
df.to_csv("data/sample8.csv", header=False, index=False)

sample5.to_csv("data/sample9.txt", sep=":", na_rep="누락")

### (7) Index

+ loc : 라벨값 기반의 2차원 인덱싱을 지원하는 인덱서
+ iloc : 순서를 나타내는 정수 기반의 인덱서
+ at
+ lat

#### loc

In [6]:
np.arange(10, 22).reshape(3, 4)

array([[10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21]])

In [10]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), columns=["A", "B", "C", "D"],
            index=["a", "b", "c"])

df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [12]:
#### 행에 접근

print(df["b":"b"])
print(df[1:2])

print("-----------------------------")

print(df.loc["b"])
# print(df.loc[2])

    A   B   C   D
b  14  15  16  17
-----------------------------
A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [ ]:
##### 행과 열에 접근

# b행 b열에 있는 하나의 값 조회
print(df["B"]["b"])
print(df["B"][1])
# print(df["B", "b"])
print("-----------------------------")
print(df.loc["b"]["B"])
# print(df.loc[1]["B"])
print(df.loc["b", "B"])

print("-----------------------------")

print(df.loc["b":, "B":])
print(df.loc[["a", "c"], ["B", "C"]])

print("-----------------------------")

# A열에 있는 값이 15보다 큰 행만 조회
print(df.loc[df.loc[:, "A"]>15])
print(df.loc[df["A"]>15])

# 모든 행에 대해서 첫번째 행에 있는 값이 11보다 작거나 같은 행의 컬럼을 조회

#### iloc

In [27]:
print(df["A"]["a"])
# print(df[0][0])

print("----------------------")

print(df.loc["a", "A"])
# print(df.loc[0, 0])

print("----------------------")

print(df.iloc[0, 0])

10
----------------------
10
----------------------
10

#### at, iat

In [28]:
%timeit df.loc["a", "A"]
%timeit df.at["a", "A"]

8.62 µs ± 266 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)
4.51 µs ± 400 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

## 3. Data Manipulation

### (1) 데이터의 개수 세기

In [31]:
##### Series

s = pd.Series(range(10))
s

print(len(s))
print(s.count())

print("----------------------")

s[3] = np.nan
s

print(len(s))
print(s.count()) # 결측치를 제외하고 카운트

10
10
----------------------
10
9

In [34]:
##### DataFrame

df = pd.DataFrame(np.random.randint(5, size=(4, 5)))
df

   0  1  2  3  4
0  4  4  3  3  2
1  1  0  2  4  1
2  0  0  1  4  2
3  4  1  4  4  3

In [35]:
df.count()

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [36]:
df.iloc[2, 3] = np.nan
df

   0  1  2    3  4
0  4  4  3  3.0  2
1  1  0  2  4.0  1
2  0  0  1  NaN  2
3  4  1  4  4.0  3

In [37]:
df.count()

0    4
1    4
2    4
3    3
4    4
dtype: int64

In [46]:
##### 카테고리별로 갯수 세기
np.random.seed(2)

s2 = pd.Series(np.random.randint(6, size=100))
s2

print(s2.value_counts())

print("------------------------------")
print(df[0].value_counts())
print(df[1].value_counts())

2    22
0    18
3    16
5    15
4    15
1    14
dtype: int64
------------------------------
4    2
1    1
0    1
Name: 0, dtype: int64
0    2
4    1
1    1
Name: 1, dtype: int64

### (2) 정렬
+ sort_index()
+ sort_values()
+ 결측치는 정렬의 대상이 되지 않는다.

In [ ]:
##### Series
np.random.seed(2)

s = pd.Series(np.random.randint(6, size=100))

print(s.value_counts().sort_index())
print("------------------------------")
print(s.value_counts().sort_values())
print("------------------------------")
print(s.sort_values(ascending=False))

In [60]:
##### DataFrame
np.random.seed(2)

df = pd.DataFrame(np.random.randint(5, size=(4, 4)))
print(df)

print("----------------------------------------------------")

print(df.sort_values(by=2))
print("----------------------------------------------------")
print(df.sort_values(by=[0, 2]))

print("----------------------------------------------------")

df1 = pd.DataFrame({"seq":[1, 3, 2], "name":["park", "lee", "choi"], "age":[30, 20, 40]})
print(df1)

print("----------------------------------------------------")

# seq를 기준으로 정렬(내림차순)
print(df1.sort_values(by="seq", ascending=False, axis=0))

print("----------------------------------------------------")

# index를 기준으로 정렬
print(df1.sort_index())
print(df1.sort_index(axis=0))
print(df1.sort_index(axis=1, ascending=False))

print("----------------------------------------------------")

print(df1) # 원본데이터는 변경되지 않음

print("----------------------------------------------------")

df1.sort_index(axis=1, ascending=False, inplace=True) # 원본데이터를 정렬
print(df1)

   0  1  2  3
0  0  0  3  2
1  3  0  2  1
2  3  2  4  4
3  4  3  4  2
----------------------------------------------------
   0  1  2  3
1  3  0  2  1
0  0  0  3  2
2  3  2  4  4
3  4  3  4  2
----------------------------------------------------
   0  1  2  3
0  0  0  3  2
1  3  0  2  1
2  3  2  4  4
3  4  3  4  2
----------------------------------------------------
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
----------------------------------------------------
   seq  name  age
1    3   lee   20
2    2  choi   40
0    1  park   30
----------------------------------------------------
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
----------------------------------------------------
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40
----------------------------------------------------
   seq  name  age
0    1  park   30
1    3   lee   20
2    2  choi   40

### (3) 행, 열의 집계 연산(합계, 평균, ...)

In [66]:
##### DataFrame
np.random.seed(2)

df = pd.DataFrame(np.random.randint(10, size=(4, 8)))
print(df)

print("----------------------------------------------------")

print(df.sum())
print("----------------------------------------------------")
print(df.sum(axis=0))
print("----------------------------------------------------")
print(df.sum(axis=1))
print("----------------------------------------------------")

df.loc["ColSum", :] = df.sum()
print(df)

print("----------------------------------------------------")

df["RowSum"] = df.sum(axis=1)
print(df)

   0  1  2  3  4  5  6  7
0  8  8  6  2  8  7  2  1
1  5  4  4  5  7  3  6  4
2  3  7  6  1  3  5  8  4
3  6  3  9  2  0  4  2  4
----------------------------------------------------
0    22
1    22
2    25
3    10
4    18
5    19
6    18
7    13
dtype: int64
----------------------------------------------------
0    22
1    22
2    25
3    10
4    18
5    19
6    18
7    13
dtype: int64
----------------------------------------------------
0    42
1    38
2    37
3    30
dtype: int64
----------------------------------------------------
           0     1     2     3     4     5     6     7
0        8.0   8.0   6.0   2.0   8.0   7.0   2.0   1.0
1        5.0   4.0   4.0   5.0   7.0   3.0   6.0   4.0
2        3.0   7.0   6.0   1.0   3.0   5.0   8.0   4.0
3        6.0   3.0   9.0   2.0   0.0   4.0   2.0   4.0
ColSum  22.0  22.0  25.0  10.0  18.0  19.0  18.0  13.0
----------------------------------------------------
           0     1     2     3     4     5     6     7  RowSum
0        8.0   8.0   6.0   2.0   8.0   7.0   2.0   1.0    42.0
1        5.0   4.0   4.0   5.0   7.0   3.0   6.0   4.0    38.0
2        3.0   7.0   6.0   1.0   3.0   5.0   8.0   4.0    37.0
3        6.0   3.0   9.0   2.0   0.0   4.0   2.0   4.0    30.0
ColSum  22.0  22.0  25.0  10.0  18.0  19.0  18.0  13.0   147.0

### (4) apply()

+ 행이나 열 단위로 더 복잡한 처리를 하고자 할 때 사용
+ 인수로 행 또는 열을 받는 함수를 apply()의 인자로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용

In [68]:
df = pd.DataFrame({
    "A":[1, 3, 4, 3, 4],
    "B":[2, 3, 1, 2, 3],
    "C":[1, 5, 2, 4, 4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [71]:
def diff(x):
    return x.max() - x.min()

###########################
print(diff(df["A"]))
print(diff(df["B"]))
print(diff(df["C"]))

print("----------------------------")

print(df.apply(diff, axis=0))
print("----------------------------")
print(df.apply(diff, axis=1))

3
2
4
----------------------------
A    3
B    2
C    4
dtype: int64
----------------------------
0    1
1    2
2    3
3    2
4    1
dtype: int64

In [73]:
##### 람다 함수
df.apply(lambda x:x.max() - x.min(), axis=0)

A    3
B    2
C    4
dtype: int64

In [74]:
print(df["A"].value_counts())
print(df["B"].value_counts())
print(df["C"].value_counts())

print("--------------------------------------")

df.apply(pd.value_counts, axis=0)

3    2
4    2
1    1
Name: A, dtype: int64
2    2
3    2
1    1
Name: B, dtype: int64
4    2
1    1
5    1
2    1
Name: C, dtype: int64
--------------------------------------

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

### (5) 숫자값을 카테고리로 변경(양적 데이터 -> 질적 데이터)
+ cut()
+ qcut()

In [81]:
# 1 ~ 15 : 미성년자
# 16 ~ 25 : 청년
# 26 ~ 35 : 중년
# 36 ~ 60 : 장년
# 61 ~ 99 : 노년

ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]

cat = pd.cut(x=ages, bins=[1, 15, 25, 35, 60, 99], 
          labels=["미성년자", "청년", "중년", "장년", "노년"])
cat

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [83]:
print(type(cat))
print(cat.categories)
print(cat.codes)

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')
[-1  0  0  1  1  3  2  4  1  3  2 -1]

In [87]:
##### qcut

data = np.random.randn(100)

cat = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
print(data)
print(cat)
pd.value_counts(cat)

[ 0.46743311 -0.65153386 -1.55111085 -0.98065937 -1.92976791  1.08920566
 -0.21475442  0.77810593  0.34417516  1.13722867 -0.03396209  0.87750193
  0.08905175  0.53228604  0.07000984  0.51154977 -0.8411135   0.73354563
  0.16921267  0.52085725  0.5488608   0.05153101  1.38705166  2.49518749
  0.06036241 -0.59235982 -0.72755832  1.35099667  0.66146251  1.8502805
  0.22939746 -1.43098002 -2.0886155  -0.30903482 -0.48219668  0.17870076
 -1.0282453  -1.98544372 -1.04766042  0.38303054 -1.99146411 -1.00385355
 -0.07417896  0.69238217  0.40211121  0.92954864  0.80795912 -1.72551928
 -2.63591063  0.98043521  0.14097589  0.83138488  0.12270617  0.69951689
  0.6688202   1.28525531  0.3208184  -1.27496244  1.04849034  1.72520311
  2.30677471  1.04133905  0.97521788  0.75213466  1.83957541 -0.47130544
 -0.53954006 -0.13503553 -1.17639612  1.43298905 -1.67455198  0.3786587
 -0.6513132  -0.94638913 -0.0589768   0.32946936 -0.60016533  0.49392574
 -0.48532313  1.56402265 -0.38919383  0.44200486 -0.25273053  1.14565511
 -0.42780534 -0.79189258 -0.45517689  1.77411629 -0.75630889 -0.77223542
  1.03157673  1.34853988 -0.40469303 -0.56127558  0.00431505 -0.33534561
 -0.94632661 -0.08740308 -1.84331213 -0.22603465]
['Q3', 'Q1', 'Q1', 'Q1', 'Q1', ..., 'Q2', 'Q1', 'Q2', 'Q1', 'Q2']
Length: 100
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

Q1    25
Q2    25
Q3    25
Q4    25
dtype: int64

### 4. Index Maniqulation

#### (1) set_index(), reset_index()

In [93]:
np.random.seed(0)

df = pd.DataFrame(np.vstack([list("ABCDE"), np.round(np.random.rand(3, 5))]).T, 
            columns=["C1", "C2", "C3", "C4"])
df

  C1   C2   C3   C4
0  A  1.0  1.0  1.0
1  B  1.0  0.0  1.0
2  C  1.0  1.0  1.0
3  D  1.0  1.0  1.0
4  E  0.0  0.0  0.0

In [94]:
df2 = df.set_index("C1")
df2

     C2   C3   C4
C1
A   1.0  1.0  1.0
B   1.0  0.0  1.0
C   1.0  1.0  1.0
D   1.0  1.0  1.0
E   0.0  0.0  0.0

In [97]:
df2.reset_index(drop=True)

    C2   C3   C4
0  1.0  1.0  1.0
1  1.0  0.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  0.0  0.0  0.0

### (2) 다중 인덱스 조작

In [106]:
##### 다중 컬럼
np.random.seed(0)

df = pd.DataFrame(np.vstack([list("ABCDE"), np.round(np.random.rand(3, 5))]).T, 
            columns=[["A", "A", "B", "B"], ["C1", "C2", "C3", "C4"]])

df.columns.names = ["Cidx1", "Cidx2"]
df

Cidx1  A         B
Cidx2 C1   C2   C3   C4
0      A  0.0  0.0  1.0
1      B  0.0  1.0  0.0
2      C  1.0  0.0  1.0
3      D  0.0  1.0  1.0
4      E  0.0  0.0  1.0

In [117]:
##### 인덱싱

# print(df["B"]["C2"])
print(df["A","C2"])
print(df[("A", "C2")])

print(df["A", "C2"][1])
print(df["A", "C2"][1:])

print("--------------------")

# loc
print(df.loc[1, ("A", "C2")])
print(df.loc[2:, ("A", "C2")])

print("--------------------")

#iloc
print(df.iloc[1, 1])
print(df.iloc[2:, 1])

0    0.0
1    0.0
2    1.0
3    0.0
4    0.0
Name: (A, C2), dtype: object
0    0.0
1    0.0
2    1.0
3    0.0
4    0.0
Name: (A, C2), dtype: object
0.0
1    0.0
2    1.0
3    0.0
4    0.0
Name: (A, C2), dtype: object
--------------------
0.0
2    1.0
3    0.0
4    0.0
Name: (A, C2), dtype: object
--------------------
0.0
2    1.0
3    0.0
4    0.0
Name: (A, C2), dtype: object

In [124]:
##### 다중 컬럼과 다중 인덱스
np.random.seed(0)
# df = pd.DataFrame(np.round(np.random.rand(6, 4), 2),
#                  columns=[["A", "A", "B", "B"], ["C", "D","C", "D"]],
#                  index=[["M", "M", "M", "F", "F", "F"], 
#                        ["id_1", "id_2", "id_3", "id_1", "id_2", "id_3"]])
df = pd.DataFrame(np.round(np.random.rand(6, 4), 2),
                 columns=[["A", "A", "B", "B"], ["C", "D","C", "D"]],
                 index=[["M", "M", "M", "F", "F", "F"], 
                       ["id_" + str(i+1) for i in range(3)]*2])
print(df)

df.columns.names = ["Cidx1", "Cidx2"]
df.index.names = ["Ridx1", "Ridx2"]
print(df)

           A           B
           C     D     C     D
M id_1  0.55  0.72  0.60  0.54
  id_2  0.42  0.65  0.44  0.89
  id_3  0.96  0.38  0.79  0.53
F id_1  0.57  0.93  0.07  0.09
  id_2  0.02  0.83  0.78  0.87
  id_3  0.98  0.80  0.46  0.78

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.55  0.72  0.60  0.54
      id_2   0.42  0.65  0.44  0.89
      id_3   0.96  0.38  0.79  0.53
F     id_1   0.57  0.93  0.07  0.09
      id_2   0.02  0.83  0.78  0.87
      id_3   0.98  0.80  0.46  0.78

In [153]:
"""
loc
----
Ridx2
id_1    0.55
"""

print(df.loc["M"]["A"] ["C"][:1])

print("---------------------------")

"""
기본 인덱스
--------------
0.55
"""

print(df["A"]["C"]["M"][0])
print("---------------------------")


"""
iloc
--------------
0.55
"""
print(df.iloc[0, 0])
print("---------------------------")

"""
iloc
--------------
Ridx1  Ridx2
M      id_1     0.55
"""

print(df.iloc[:1, 0])

print("---------------------------")

Ridx2
id_1    0.55
Name: C, dtype: float64
---------------------------
0.55
---------------------------
0.55
---------------------------
Ridx1  Ridx2
M      id_1     0.55
Name: (A, C), dtype: float64

In [159]:
##### 행 인덱스와 열 인덱스를 교환 : stack() - 열을 행으로, 
#####                                unstack() - 행을 열로

print(df.T)
print("----------------------------")

print(df.stack("Cidx1"))

print("----------------------------")

print(df.stack(0))

print("----------------------------")

print(df.stack(1))

print("----------------------------")

print(df.unstack("Ridx1"))

print("----------------------------")

print(df.unstack(0))

print("----------------------------")

print(df.unstack(1))

Ridx1           M                 F
Ridx2        id_1  id_2  id_3  id_1  id_2  id_3
Cidx1 Cidx2
A     C      0.55  0.42  0.96  0.57  0.02  0.98
      D      0.72  0.65  0.38  0.93  0.83  0.80
B     C      0.60  0.44  0.79  0.07  0.78  0.46
      D      0.54  0.89  0.53  0.09  0.87  0.78
----------------------------
Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      0.55  0.72
            B      0.60  0.54
      id_2  A      0.42  0.65
            B      0.44  0.89
      id_3  A      0.96  0.38
            B      0.79  0.53
F     id_1  A      0.57  0.93
            B      0.07  0.09
      id_2  A      0.02  0.83
            B      0.78  0.87
      id_3  A      0.98  0.80
            B      0.46  0.78
----------------------------
Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      0.55  0.72
            B      0.60  0.54
      id_2  A      0.42  0.65
            B      0.44  0.89
      id_3  A      0.96  0.38
            B      0.79  0.53
F     id_1  A      0.57  0.93
            B      0.07  0.09
      id_2  A      0.02  0.83
            B      0.78  0.87
      id_3  A      0.98  0.80
            B      0.46  0.78
----------------------------
Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      0.55  0.60
            D      0.72  0.54
      id_2  C      0.42  0.44
            D      0.65  0.89
      id_3  C      0.96  0.79
            D      0.38  0.53
F     id_1  C      0.57  0.07
            D      0.93  0.09
      id_2  C      0.02  0.78
            D      0.83  0.87
      id_3  C      0.98  0.46
            D      0.80  0.78
----------------------------
Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.57  0.55  0.93  0.72  0.07  0.60  0.09  0.54
id_2   0.02  0.42  0.83  0.65  0.78  0.44  0.87  0.89
id_3   0.98  0.96  0.80  0.38  0.46  0.79  0.78  0.53
----------------------------
Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.57  0.55  0.93  0.72  0.07  0.60  0.09  0.54
id_2   0.02  0.42  0.83  0.65  0.78  0.44  0.87  0.89
id_3   0.98  0.96  0.80  0.38  0.46  0.79  0.78  0.53
----------------------------
Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.57  0.02  0.98  0.93  0.83  0.80  0.07  0.78  0.46  0.09  0.87  0.78
M      0.55  0.42  0.96  0.72  0.65  0.38  0.60  0.44  0.79  0.54  0.89  0.53

In [160]:
##### 순서 교환 : swaplevel()

df.swaplevel("Ridx1", "Ridx2", axis=0)
df.swaplevel("Cidx1", "Cidx2", axis=1)

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   0.55  0.72  0.60  0.54
      id_2   0.42  0.65  0.44  0.89
      id_3   0.96  0.38  0.79  0.53
F     id_1   0.57  0.93  0.07  0.09
      id_2   0.02  0.83  0.78  0.87
      id_3   0.98  0.80  0.46  0.78

In [163]:
##### 정렬

print(df)
print("-------------------------------------")
print(df.sort_index(level=0, axis=0))
print("-------------------------------------")
print(df.sort_index(level=1, axis=0))
print("-------------------------------------")
print(df.sort_index(level=1, axis=1))

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.55  0.72  0.60  0.54
      id_2   0.42  0.65  0.44  0.89
      id_3   0.96  0.38  0.79  0.53
F     id_1   0.57  0.93  0.07  0.09
      id_2   0.02  0.83  0.78  0.87
      id_3   0.98  0.80  0.46  0.78
-------------------------------------
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
F     id_1   0.57  0.93  0.07  0.09
      id_2   0.02  0.83  0.78  0.87
      id_3   0.98  0.80  0.46  0.78
M     id_1   0.55  0.72  0.60  0.54
      id_2   0.42  0.65  0.44  0.89
      id_3   0.96  0.38  0.79  0.53
-------------------------------------
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
F     id_1   0.57  0.93  0.07  0.09
M     id_1   0.55  0.72  0.60  0.54
F     id_2   0.02  0.83  0.78  0.87
M     id_2   0.42  0.65  0.44  0.89
F     id_3   0.98  0.80  0.46  0.78
M     id_3   0.96  0.38  0.79  0.53
-------------------------------------
Cidx1           A     B     A     B
Cidx2           C     C     D     D
Ridx1 Ridx2
M     id_1   0.55  0.60  0.72  0.54
      id_2   0.42  0.44  0.65  0.89
      id_3   0.96  0.79  0.38  0.53
F     id_1   0.57  0.07  0.93  0.09
      id_2   0.02  0.78  0.83  0.87
      id_3   0.98  0.46  0.80  0.78

In [1]:
df_score1 = pd.DataFrame({
    "반":["A", "A", "B", "A", "B", "B", "B", "A", "B", "A"],
    "번호" : [1, 2, 1, 3, 2, 3, 4, 4, 5, 5],
    "국어" : [79, 67, 88, 68, 92, 54, 67, 88, 97, 85],
    "영어" : [55, 77, 44, 67, 86, 45, 78, 58, 90, 67],
    "수학" : [57, 45, 76, 68, 89, 67, 99, 78, 89, 90]
})
df_score1

#1. 1차 행 인덱스로 "반"을, 2차 행 인덱스로 "번호"를 가지는 데이터 프레임 작성



#2. 위의 데이터를 인덱스로 정렬

#3. 학생의 평균을 나타내는 행을 오른쪽에 추가

#4. 행 인덱스로 "번호"를, 1차 열 인덱스로 "국어", "영어", "수학"을, 2차 열 인덱스로 "반"을 가지는 
# 데이터프레임 작성

#5. 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가

NameError: name 'pd' is not defined

### 데이터 프레임 합성(병합)

+ merge()
    + 두 데이터프레임의 공통 열 또는 인덱스를 기준으로 두 개의 테이블을 합친다.
    + 이 때 기준이 되는 열, 행의 데이터를 key라고 한다.

+ concat()
    + 기준열을 사용하지 않고 단순히 데이터를 연결

In [3]:
df1 = pd.DataFrame({
    "고객번호":[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    "이름":["둘리", "도우너", "또치", "길동", "희동", "마이콜", "영희"]
})
print(df1)
print("=========================================")
df2 = pd.DataFrame({
    "고객번호":[1001, 1001, 1005, 1006, 1008, 1001],
    "금액":[10000, 20000, 15000, 5000, 100000, 30000]
})
print(df2)

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희
=========================================
   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [8]:
print(pd.merge(df1, df2))  # inner join
print("=========================================")
print(pd.merge(df1, df2, how = "left"))   # left outer join
print("=========================================")
print(pd.merge(df1, df2, how = "right"))   # right outer join
print("=========================================")
print(pd.merge(df1, df2, how = "outer"))   # outer join

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000
=========================================
   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN
=========================================
   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000
=========================================
   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [10]:
##### 키가 여러 개인 경우

df1 = pd.DataFrame({
    "고객명":["춘향", "춘향", "몽룡"],
    "날짜":["2019-01-01", "2019-01-02", "2019-01-03"], 
    "데이터":["20000", "30000", "100000"]
})

df2 = pd.DataFrame({
    "고객명":["춘향", "몽룡"],
    "데이터":["여자", "남자"]
})

print(df1)
print("-------------------------------------------")
print(df2)
print("===========================================")

pd.merge(df1, df2, on = "고객명")

  고객명          날짜     데이터
0  춘향  2019-01-01   20000
1  춘향  2019-01-02   30000
2  몽룡  2019-01-03  100000
-------------------------------------------
  고객명 데이터
0  춘향  여자
1  몽룡  남자
===========================================

  고객명          날짜   데이터_x 데이터_y
0  춘향  2019-01-01   20000    여자
1  춘향  2019-01-02   30000    여자
2  몽룡  2019-01-03  100000    남자

In [16]:
##### 공통된 키가 없는 경우

df1 = pd.DataFrame({
    "이름":["영희", "철수", "철수"],
    "성적":[1, 2, 3]
})

df2 = pd.DataFrame({
    "성명":["영희", "영희", "철수"],
    "점수":[4, 5, 6]
})

print(df1)
print("------------------------------")
print(df2)

print("==============================")

   이름  성적
0  영희   1
1  철수   2
2  철수   3
------------------------------
   성명  점수
0  영희   4
1  영희   5
2  철수   6
==============================

In [14]:
#### 인덱스를 기준열로 사용하는 경우(한쪽은 컬럼, 한쪽은 인덱스)

df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
print(df1)
print("------------------------------")


df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
print(df2)

print("==============================")

pd.merge(df1, df2, left_on=["도시", "연도"], right_index=True)

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547
------------------------------
         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11
==============================

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [17]:
##### 인덱스를 기준열로 사용하는 경우(둘 다 인덱스)

df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
print(df1)
print("------------------------------")


df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['대구', '광주'])
print(df2)
print("========================================")

pd.merge(df1, df2, left_index=True, right_index=True)
pd.merge(df1, df2, left_index=True, right_index=True, how="outer")

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0
------------------------------
     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0
========================================

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

### concat()

In [19]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])

print(df1)

print("-------------------------------------")

df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])

print(df2)

print("======================================")

pd.concat([df1, df2], axis=0)
pd.concat([df1, df2], axis=1)

   데이터1  데이터2
a     0     1
b     2     3
c     4     5
-------------------------------------
   데이터3  데이터4
a     5     6
c     7     8
======================================

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

### 6. 피봇 테이블과 그룹 분석

+ pivot()
    - pd.pivoy(index, columns, values)
    
+ groupby()
    - pd.DataFrame.groupby(by, axis, level, as_index: 'bool' = True, sort, group_keys, squeeze,             observed, dropna,)

+ pivoy_table()
    - pd.DataFrame.pivot_table(self, values, index, columns, aggfunc, fill_value, margins=False,           dropna, margins_name, observed, sort)

### (1) pivot()

In [25]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df = pd.DataFrame(data)
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [27]:
##### 각 도시에서 연도별로 인구 수를 알고 싶다

# df.pivot(index="도시", columns="연도", values="인구")
df.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [29]:
df2 = df.set_index(["연도", "도시"])
df2

del df2["지역"]
df2.unstack("연도")

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [33]:
# df[["도시", "연도", "인구"]].set_index(["도시", "연도"]).unstack("연도")

# df.set_index(["도시", "연도"])[["인구"]].unstack("연도")

df.set_index(["도시", "연도"]).unstack("연도")[["인구"]]

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### (2) groupby()

+ 반드시 집계 함수와 함께 사용
    size(), count()
    mean(), median(), min(), max()
    sum(), prod(), std(), var(), quantile()
    first(), last()
    agg(), aggreate()
    describe()
    apply()
    transform()
    ...

In [35]:
df2 = pd.DataFrame({
    "key1":["A", "A", "B", "B", "A"],
    "key2":["one", "two", "one", "two", "one"],
    "data1":[1, 2, 3, 4, 5],
    "data2":[10, 20, 30, 40, 50]
})

df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [43]:
print(df2.groupby(by="key1").sum())

print("-----------------------------")
print(df2.data1.groupby(df2.key1).sum())
print("-----------------------------")
print(df2.groupby("key1")["data1"].sum())
print("-----------------------------")
print(df2.groupby("key1").sum()[["data1"]])

      data1  data2
key1
A         8     80
B         7     70
-----------------------------
key1
A    8
B    7
Name: data1, dtype: int64
-----------------------------
key1
A    8
B    7
Name: data1, dtype: int64
-----------------------------
      data1
key1
A         8
B         7

In [46]:
##### 복합 키

print(df2.data1.groupby([df2.key1, df2.key2]).sum())
print("-----------------------------")
print(df2.data1.groupby([df2.key1, df2.key2]).sum().unstack("key1"))

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64
-----------------------------
key1  A  B
key2
one   6  3
two   2  4

In [48]:
##### 각 도시에서 연도별로 인구 수를 알고 싶다.
df.groupby(["도시", "연도"]).sum().unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [5]:
##### agg(), apply(), transform()

import seaborn as sns

iris = sns.load_dataset("iris")
iris.describe()
iris.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [12]:
# 각 붓꽃별로 가장 큰 값과 가장 작은 값의 비율을 조회

def peek_to_peek_ratio(x):
    return x.max() / x.min()

#######################################

print(iris.groupby(iris.species).sum())
print("----------------------------------------------------")
print(iris.groupby(iris.species).apply(peek_to_peek_ratio))
print("----------------------------------------------------")
print(iris.groupby(iris.species).agg(peek_to_peek_ratio))
print("----------------------------------------------------")
print(iris.groupby(iris.species).transform(peek_to_peek_ratio))

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3
----------------------------------------------------
            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714
----------------------------------------------------
            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714
----------------------------------------------------
     sepal_length  sepal_width  petal_length  petal_width
0        1.348837     1.913043      1.900000     6.000000
1        1.348837     1.913043      1.900000     6.000000
2        1.348837     1.913043      1.900000     6.000000
3        1.348837     1.913043      1.900000     6.000000
4        1.348837     1.913043      1.900000     6.000000
..            ...          ...           ...          ...
145      1.612245     1.727273      1.533333     1.785714
146      1.612245     1.727273      1.533333     1.785714
147      1.612245     1.727273      1.533333     1.785714
148      1.612245     1.727273      1.533333     1.785714
149      1.612245     1.727273      1.533333     1.785714

[150 rows x 4 columns]

In [18]:
##### 각 붓꽃별로 가장 꽃잎 길이가 작은 것 3개만 조회

def min3(x):
    return x.sort_values(by="petal_length")[:3]

#######################################

print(iris.groupby(iris.species).apply(min3))
print("----------------------------------------------------")
# print(iris.groupby(iris.species).agg(min3))
# print(iris.groupby(iris.species).transform(min3))

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     22            4.6          3.6           1.0          0.2
           13            4.3          3.0           1.1          0.1
           14            5.8          4.0           1.2          0.2
versicolor 98            5.1          2.5           3.0          1.1
           93            5.0          2.3           3.3          1.0
           57            4.9          2.4           3.3          1.0
virginica  106           4.9          2.5           4.5          1.7
           126           6.2          2.8           4.8          1.8
           138           6.0          3.0           4.8          1.8

                   species
species
setosa     22       setosa
           13       setosa
           14       setosa
versicolor 98   versicolor
           93   versicolor
           57   versicolor
virginica  106   virginica
           126   virginica
           138   virginica
----------------------------------------------------

In [21]:
def test(x):
    return 1

#############################
print(iris.groupby(iris.species).apply(test))
print("----------------------------------------------------")
print(iris.groupby(iris.species).agg(test))
print("----------------------------------------------------")
print(iris.groupby(iris.species).transform(test))

species
setosa        1
versicolor    1
virginica     1
dtype: int64
----------------------------------------------------
            sepal_length  sepal_width  petal_length  petal_width
species
setosa                 1            1             1            1
versicolor             1            1             1            1
virginica              1            1             1            1
----------------------------------------------------
     sepal_length  sepal_width  petal_length  petal_width
0               1            1             1            1
1               1            1             1            1
2               1            1             1            1
3               1            1             1            1
4               1            1             1            1
..            ...          ...           ...          ...
145             1            1             1            1
146             1            1             1            1
147             1            1             1            1
148             1            1             1            1
149             1            1             1            1

[150 rows x 4 columns]

In [24]:
iris.groupby("species").agg([np.sum, np.mean, np.std, peek_to_peek_ratio])

           sepal_length                                     sepal_width  \
                    sum   mean       std peek_to_peek_ratio         sum
species
setosa            250.3  5.006  0.352490           1.348837       171.4
versicolor        296.8  5.936  0.516171           1.428571       138.5
virginica         329.4  6.588  0.635880           1.612245       148.7

                                               petal_length                   \
             mean       std peek_to_peek_ratio          sum   mean       std
species
setosa      3.428  0.379064           1.913043         73.1  1.462  0.173664
versicolor  2.770  0.313798           1.700000        213.0  4.260  0.469911
virginica   2.974  0.322497           1.727273        277.6  5.552  0.551895

                              petal_width
           peek_to_peek_ratio         sum   mean       std peek_to_peek_ratio
species
setosa               1.900000        12.3  0.246  0.105386           6.000000
versicolor           1.700000        66.3  1.326  0.197753           1.800000
virginica            1.533333       101.3  2.026  0.274650           1.785714

In [ ]:
##### 연습 문제
df = pd.DataFrame({
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})

print(df)

print("===========================================================")

# 1) 도시별로 과일의 가격 평균과 수량 평균을 구하시오.

# 2) 도시별, 과일별 가격 평균과 수량 평균을 구하시오.

# 3) 위의 문제에서 도시별, 과일별을 인덱스로 하고 싶지 않은 경우

# 4) 도시별로 가격의 평균과 수량의 합계를 동시에 구하시오.

### (3) pivot_table()

In [26]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}

df = pd.DataFrame(data)
df

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [30]:
##### 각 도시에서 연도별로 인구 수를 알고 싶다.

df.pivot(index="도시", columns="연도", values="인구")
df.groupby(["도시", "연도"])[["인구"]].sum().unstack()

df.pivot_table(values="인구", index="도시", columns="연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [35]:
##### 연도별, 도시별로 인구수를 알고 싶다.

# df.pivot(index=["연도", "도시"], columns="인구", values="인구")
print(df.groupby(["연도", "도시"])[["인구"]].sum())
print("===========================================================")
print(df.pivot_table("인구", ["연도", "도시"]))
print("===========================================================")
print(df.pivot_table("인구", ["연도", "도시"], aggfunc="sum"))

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451
===========================================================
              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451
===========================================================
              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [39]:
print(df.pivot_table("인구", "연도", "도시", aggfunc="sum", margins=True, 
                    margins_name="합계", fill_value=0))

도시          부산        서울       인천        합계
연도
2005   3512547   9762546        0  13275093
2010   3393191   9631482   263203  13287876
2015   3448737   9904312  2890451  16243500
합계    10354475  29298340  3153654  42806469

### 7. 활용 예제

In [2]:
import seaborn as sns
tips = sns.load_dataset("tips")

In [3]:
print(tips.head())
print(tips.tail())
print(tips.describe())
print(tips.info())

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2
       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB
None

In [5]:
##### 식사 대금과 팁의 비율(tip/total_bill)을 나타내는 tip_pct라는 파생변수 추가

tips["tip_pct"] = tips.tip / tips.total_bill
tips.head(10)

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240
6        8.77  2.00    Male     No  Sun  Dinner     2  0.228050
7       26.88  3.12    Male     No  Sun  Dinner     4  0.116071
8       15.04  1.96    Male     No  Sun  Dinner     2  0.130319
9       14.78  3.23    Male     No  Sun  Dinner     2  0.218539

In [11]:
##### 성별로 인원수 파악
print(tips.groupby("sex")[["size"]].describe())
print("------------------------------------------------------------")
print(tips.groupby("sex").count())
print("------------------------------------------------------------")
print(tips.groupby("sex").size())
print("------------------------------------------------------------")
print(tips["sex"].value_counts())

         size
        count      mean       std  min  25%  50%  75%  max
sex
Male    157.0  2.630573  0.955997  1.0  2.0  2.0  3.0  6.0
Female   87.0  2.459770  0.937644  1.0  2.0  2.0  3.0  6.0
------------------------------------------------------------
        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87
------------------------------------------------------------
sex
Male      157
Female     87
dtype: int64
------------------------------------------------------------
Male      157
Female     87
Name: sex, dtype: int64

In [47]:
##### 성별, 흡연 유무별로 인원수 파악

In [48]:
##### 위의 두 정보를 하나의 테이블로 tip_pct로 조회

"""
smoker    Yes   No
   sex
   Male   ...
   Femal  ...
"""

In [49]:
##### 성별에 따른 평균 팁 비율

In [50]:
##### 흡연 여부에 따른 팁 비율

In [51]:
##### 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지
##### 살펴볼 수 있도록 조회

In [ ]:
##### 성별, 흡연 유무별로 가장 많은 팁과 가장 적은 팁의 차이